Конфигурация/Проверка/InformationRegisters/_ДемоШтрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_ДемоШтрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ДемоТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользоватьДляУпаковки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Проверка/InformationRegisters/_ДемоШтрихкоды/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = _ДемоПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ПриЗакрытии" формы.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаОповещения" формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И Параметр.Свойство("Штрихкод") Тогда
			Если Не ОбработатьПолученныйШК(Параметр.Штрихкод) Тогда
				ТекстСообщения = НСтр("ru = 'Штрихкод %ШКод% не найден.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ШКод%", Параметр.Штрихкод);
				ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция производит поиск записи в регистре сведений по измерению Штрихкод
// и позиционируется на ней в списке.
// Результат - структура с ключами "Владелец", "Штрихкод", "ТипШтрихкода".
// Если ключ "Владелец" отсутствует, то запись не найдена.
//
&НаСервере
Функция ОбработатьПолученныйШК(ТекКод)
	
	ВозвращаемоеЗначение = Истина;
	
	Результат = _ДемоПодключаемоеОборудованиеВызовСервера.ПоискПоРегиструСведенийШтрихкоды(ТекКод);
	Если Результат.Свойство("Владелец") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Владелец", Результат.Владелец);
		Отбор.Вставить("Штрихкод", ТекКод);
		Отбор.Вставить("ТипШтрихкода", Результат.ТипШтрихкода);
		КлючЗаписи = РегистрыСведений._ДемоШтрихкоды.СоздатьКлючЗаписи(Отбор);
		Элементы.Список.ТекущаяСтрока = КлючЗаписи;
	Иначе
		ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	Возврат ВозвращаемоеЗначение;
	
КонецФункции   

#КонецОбласти
